In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
df = pd.read_csv('space_missions.csv',encoding='latin-1')

In [3]:
df.head()

,Company,Location,Date,Time,Rocket,Mission,RocketStatus,Price,MissionStatus
0,RVSN USSR,"Site 1/5, Baikonur Cosmodrome, Kazakhstan",1957-10-04,19:28:00,Sputnik 8K71PS,Sputnik-1,Retired,NaN,Success
1,RVSN USSR,"Site 1/5, Baikonur Cosmodrome, Kazakhstan",1957-11-03,02:30:00,Sputnik 8K71PS,Sputnik-2,Retired,NaN,Success
2,US Navy,"LC-18A, Cape Canaveral AFS, Florida, USA",1957-12-06,16:44:00,Vanguard,Vanguard TV3,Retired,NaN,Failure
3,AMBA,"LC-26A, Cape Canaveral AFS, Florida, USA",1958-02-01,03:48:00,Juno I,Explorer 1,Retired,NaN,Success
4,US Navy,"LC-18A, Cape Canaveral AFS, Florida, USA",1958-02-05,07:33:00,Vanguard,Vanguard TV3BU,Retired,NaN,Failure

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4630 entries, 0 to 4629
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Company        4630 non-null   object
 1   Location       4630 non-null   object
 2   Date           4630 non-null   object
 3   Time           4503 non-null   object
 4   Rocket         4630 non-null   object
 5   Mission        4630 non-null   object
 6   RocketStatus   4630 non-null   object
 7   Price          1265 non-null   object
 8   MissionStatus  4630 non-null   object
dtypes: object(9)
memory usage: 325.7+ KB

In [5]:
df["Date"] = pd.to_datetime(df["Date"])

In [6]:
df.columns

Index(['Company', 'Location', 'Date', 'Time', 'Rocket', 'Mission',
       'RocketStatus', 'Price', 'MissionStatus'],
      dtype='object')

In [7]:
df.shape

(4630, 9)

In [8]:
df.nunique()

Company            62
Location          158
Date             4180
Time             1300
Rocket            370
Mission          4556
RocketStatus        2
Price              65
MissionStatus       4
dtype: int64

In [9]:
df.isnull().sum()

Company             0
Location            0
Date                0
Time              127
Rocket              0
Mission             0
RocketStatus        0
Price            3365
MissionStatus       0
dtype: int64

In [10]:
df.Company.value_counts(dropna=False)

RVSN USSR           1777
CASC                 338
Arianespace          293
General Dynamics     251
VKS RF               216
                    ...
OneSpace               1
Douglas                1
GK LS                  1
Firefly                1
CAS Space              1
Name: Company, Length: 62, dtype: int64

In [11]:
df.Location.value_counts(dropna=False)

Site 31/6, Baikonur Cosmodrome, Kazakhstan               251
Site 132/1, Plesetsk Cosmodrome, Russia                  216
Site 43/4, Plesetsk Cosmodrome, Russia                   211
Site 41/1, Plesetsk Cosmodrome, Russia                   198
Site 1/5, Baikonur Cosmodrome, Kazakhstan                193
                                                        ...
Pad A, Boca Chica, Texas, USA                              1
K-496 Submarine, Barents Sea Launch Area, Barents Sea      1
Launch Plateform, Shahrud Missile Test Site                1
K-84 Submarine, Barents Sea Launch Area, Barents Sea       1
LC-9A, Taiyuan Satellite Launch Center, China              1
Name: Location, Length: 158, dtype: int64

In [12]:
df.Rocket.value_counts(dropna=False)

Cosmos-3M (11K65M)     446
Voskhod                299
Molniya-M /Block ML    128
Cosmos-2I (63SM)       126
Soyuz U                125
                      ...
Delta II 6925-8          1
Delta 4925-8             1
Antares 130              1
Start                    1
Zhongke-1A               1
Name: Rocket, Length: 370, dtype: int64

In [13]:
df.columns

Index(['Company', 'Location', 'Date', 'Time', 'Rocket', 'Mission',
       'RocketStatus', 'Price', 'MissionStatus'],
      dtype='object')

In [14]:
df["Mission"].value_counts(dropna=False)

DSP                   8
Demo Flight           8
KH-11                 6
BOR-5 Shuttle         6
Osumi                 5
                     ..
Meteor nâ Â­36       1
Cosmos 860            1
Cosmos 861            1
Cosmos 862            1
Yaogan 35 Group 03    1
Name: Mission, Length: 4556, dtype: int64

In [15]:
df["RocketStatus"].value_counts(dropna=False)

Retired    3620
Active     1010
Name: RocketStatus, dtype: int64

In [16]:
df["Price"].value_counts(dropna=False)

NaN      3365
450       136
67        111
200        80
64.68      58
         ...
27          2
55          1
15          1
20.14       1
28.3        1
Name: Price, Length: 66, dtype: int64

In [17]:
df["MissionStatus"].value_counts(dropna=False)

Success              4162
Failure               357
Partial Failure       107
Prelaunch Failure       4
Name: MissionStatus, dtype: int64

In [18]:
df.head()

,Company,Location,Date,Time,Rocket,Mission,RocketStatus,Price,MissionStatus
0,RVSN USSR,"Site 1/5, Baikonur Cosmodrome, Kazakhstan",1957-10-04,19:28:00,Sputnik 8K71PS,Sputnik-1,Retired,NaN,Success
1,RVSN USSR,"Site 1/5, Baikonur Cosmodrome, Kazakhstan",1957-11-03,02:30:00,Sputnik 8K71PS,Sputnik-2,Retired,NaN,Success
2,US Navy,"LC-18A, Cape Canaveral AFS, Florida, USA",1957-12-06,16:44:00,Vanguard,Vanguard TV3,Retired,NaN,Failure
3,AMBA,"LC-26A, Cape Canaveral AFS, Florida, USA",1958-02-01,03:48:00,Juno I,Explorer 1,Retired,NaN,Success
4,US Navy,"LC-18A, Cape Canaveral AFS, Florida, USA",1958-02-05,07:33:00,Vanguard,Vanguard TV3BU,Retired,NaN,Failure

In [19]:
df.groupby("MissionStatus")["RocketStatus"].count()

MissionStatus
Failure               357
Partial Failure       107
Prelaunch Failure       4
Success              4162
Name: RocketStatus, dtype: int64